---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.GetProfile
source: html/63e8bb2b-b53c-b0e1-995c-8d24428b824b.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.GetProfile Method

Return the profile of the loaded fabrication configuration. Return empty string for global profile.

## Syntax (C#)
```csharp
public string GetProfile()
```